src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сделки/Forms/ФормаНастройкиОбязательныхПолей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеОбязательныхПолей = Константы.ОбязательныеПоляСделки.Получить().Получить();	
	
	СписокПолей = ПолучитьСписокПолей();
	
	Если ЗначениеЗаполнено(ДанныеОбязательныхПолей) Тогда
		
		Для Каждого Поле Из СписокПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = Поле.Значение;
			ОбязательноеПоле.ПредставлениеПоля	 = Поле.Представление;
			ОбязательноеПоле.Обязательно		 = Ложь;
			
			Для Каждого ДанныеПоля Из ДанныеОбязательныхПолей Цикл
				Если ДанныеПоля.Поле = Поле.Значение Тогда
					ОбязательноеПоле.Обязательно = ДанныеПоля.Обязательно;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Поле Из СписокПолей Цикл
			
			ОбязательноеПоле					 = ЭтотОбъект.ОбязательныеПоля.Добавить();
			ОбязательноеПоле.Поле				 = Поле.Значение;
			ОбязательноеПоле.ПредставлениеПоля	 = Поле.Представление;
			ОбязательноеПоле.Обязательно		 = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, сохраняет значение константы и закрывает форму.
//
Процедура Сохранить(Команда)
	
	ЗначениеКонстанты = Новый Массив;
	
	Для Каждого ДанныеПоля Из ЭтотОбъект.ОбязательныеПоля Цикл
		
		СтруктураДанныхПоля = Новый Структура;
		СтруктураДанныхПоля.Вставить("Поле"				, ДанныеПоля.Поле);
		СтруктураДанныхПоля.Вставить("Обязательно"		, ДанныеПоля.Обязательно);
		СтруктураДанныхПоля.Вставить("ПредставлениеПоля", ДанныеПоля.ПредставлениеПоля);
		
		ЗначениеКонстанты.Добавить(СтруктураДанныхПоля);
		
	КонецЦикла;
	
	СохранитьЗначениеКонстанты(ЗначениеКонстанты);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает список полей.
//
Функция ПолучитьСписокПолей()
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("ИсточникИнформации"	, "Рекламный источник");
	СписокПолей.Добавить("КаналПривлечения"		, "Канал привлечения");
	СписокПолей.Добавить("СтруктурнаяЕдиница"	, "Клиника");
	СписокПолей.Добавить("Врач"					, "Врач");
	
	Возврат СписокПолей;
	
КонецФункции	

&НаСервереБезКонтекста
// Процедура, сохраняет значение константы.
//
Процедура СохранитьЗначениеКонстанты(ЗначениеКонстанты)
	
	Константы.ОбязательныеПоляСделки.Установить(Новый ХранилищеЗначения(ЗначениеКонстанты));
	
КонецПроцедуры

#КонецОбласти
